{
  "translation": {
    "Sign Up": "QEYDİYYATDAN KEÇİN",
    "Log in": "DAXİL OLUN",
    "Sign Up for Free": "Pulsuz Qeydiyyatdan Keçin",
    "Welcome back": "Qayıdışınız Xoş gəldiniz",
    "GET STARTED": "BAŞLAYAQ",
    "Enter your username": "İstifadəçi adınızı daxil edin...",
    "Enter your email address": "E-poçt ünvanınızı daxil edin...",
    "Set a password": "Şifrə təyin edin...",
    "Confirm the password": "Şifrəni təsdiqləyin...",
    "Forgot Password": "Şifrəni unutdum",
    "Remember me": "Məni xatırla",
    "404 - Not Found": "404 - Tapılmadı",
    "Sorry, the page you are looking for does not exist": "Üzr istəyirik, axtardığınız səhifə mövcud deyil.",
    "Exit": "Çıxış",
    "Send Feedback": "Feedback göndərin",
    "Delete Account": "Hesabı sil",
    "Year": "İl",
    "Rating": "Reytinq",
    "Genre": "Janr",
    "Comment": "Şərh",
    "Name": "Ad:",
    "Last name": "Soyad:",
    "Phone": "Telefon:",
    "Email": "E-poçt:",
    "Suggestion": "Təklif:",
    "Submit": "Göndər",
    "Reset Password": "Şifrəni yenidən qurun",
    "Title": "Başlıq",
    "Enter movie title": "Film adını daxil edin...",
    "Year (between 1900 and 2025)": "İl (1900 və 2025 arasında)",
    "Action": "Əməliyyat",
    "Comedy": "Komediya",
    "Drama": "Drama",
    "Horror": "Ürək-ürəkən",
    "Science Fiction": "Elmi fantastika",
    "Enter a comment": "Şərh daxil edin...",
    "Rating (between 0 and 10)": "Reytinq (0 və 10 arasında)",
    "Add": "Əlavə et",
    "Previous": "Əvvəlki",
    "Next": "Növbəti",
    "Films": "Filmlər",
    "Add film to Watch List": "Film siyahısına əlavə edin",
    "Add film": "Film əlavə edin",
    "Download as .txt": "kimi yükləyin .txt",
    "Download as .docx": "kimi yükləyin .docx",
    "Download as .json": "kimi yükləyin .json",
    "Watched Films": "İzlənən filmlər",
    "Unwatched Films": "İzlənməyən filmlər",
    "Search either by title or by year or by genre or by rating": "Axtarışı başlıq, il, janr və ya reytinq ilə etmək mümkündür",
    "Edit": "Redaktə et",
    "Update": "Yenilə",
    "Delete": "Sil",
    "To Main List": "Əsas siyahıya",
    "To Watch List": "İzləmək üçün siyahıya",
    "Not interested": "Marag yoxdur",
    "Bad interface": "Pis interfeys",
    "Bad features": "Pis xüsusiyyətlər",
    "Found new website": "Yeni veb sayt tapıldı",
    "Other": "Digər",
    "Type \"yes\" to confirm deletion": "Silinməni təsdiq etmək üçün \"bəli\" yazın:",
    "Thank you for your feedback! You'll be navigated to the menu.": "Rəyiniz üçün təşəkkür edirik! Siz menyunu açılacaqsınız.",
    "An error occurred:": "Səhv baş verdi:",
    "An error occurred while sending a feedback. Please try again later.": "Feedback göndərmə zamanı səhv baş verdi. Zəhmət olmasa, daha sonra yenidən cəhd edin.",
    "Your email was reseted successfully! Check your email!": "E-poçtunuz uğurla sıfırlandı! E-poçtunuzu yoxlayın!",
    "An error occurred while reseting a password. Please try again later.": "Şifrəni yenidən qurma zamanı səhv baş verdi. Zəhmət olmasa, daha sonra yenidən cəhd edin.",
    "An error occurred while getting film data. Please try again later.": "Film məlumatlarını alma zamanı səhv baş verdi. Zəhmət olmasa, daha sonra yenidən cəhd edin.",
    "Please select a reason and type \"yes\" in the confirmation field.": "Zəhmət olmasa, bir səbəb seçin və təsdiq sahəsində \"bəli\" yazın.",
    "An error occurred while getting deleting an account. Please try again later": "Hesabı silmək zamanı səhv baş verdi. Zəhmət olmasa, daha sonra yenidən cəhd edin.",
    "You successfully deleted your account! You'll be navigated to the menu.": "Siz uğurla hesabınızı silmisiniz! Siz menyunu açılacaqsınız.",
    "Please specify movie genre and title.": "Zəhmət olmasa, film janrını və başlığını göstərin.",
    "An error occurred while adding a film. Please try again later.": "Film əlavə etmə zamanı səhv baş verdi. Zəhmət olmasa, daha sonra yenidən cəhd edin.",
    "An error occurred while generating a random login. Please try again later.": "Təsadüfi giriş yaradarkən səhv baş verdi. Zəhmət olmasa, daha sonra yenidən cəhd edin.",
    "An error occurred while downloading your list of films. Please try again later.": "Film siyahını yükləmə zamanı səhv baş verdi. Zəhmət olmasa, daha sonra yenidən cəhd edin.",
    "An error occurred while downloading your list of films (watch list). Please try again later.": "Film siyahısını (izləmək üçün siyahı) yükləmə zamanı səhv baş verdi. Zəhmət olmasa, daha sonra yenidən cəhd edin.",
    "An error occurred while updating a film. Please try again later.": "Film yeniləmə zamanı səhv baş verdi. Zəhmət olmasa, daha sonra yenidən cəhd edin.",
    "An error occurred while deleting a film. Please try again later.": "Film silmə zamanı səhv baş verdi. Zəhmət olmasa, daha sonra yenidən cəhd edin.",
    "An error occurred while downloading locally your list of films. Please try again later.": "Film siyahısını yerli olaraq yükləmə zamanı səhv baş verdi. Zəhmət olmasa, daha sonra yenidən cəhd edin.",
    "An error occurred while changing a password. Please try again later.": "Şifrə dəyişmə zamanı səhv baş verdi. Zəhmət olmasa, daha sonra yenidən cəhd edin.",
    "Your password was successfully changed! You'll be navigated to the menu.": "Şifrəniz uğurla dəyişdirildi! Siz menyunu açılacaqsınız.",
    "Old Password": "Köhnə Şifrə:",
    "New Password": "Yeni Şifrə:",
    "Confirm New Password": "Yeni Şifrəni Təsdiqlə:",
    "Change Password": "Şifrəni dəyişdirin",
    "Password and confirm password don't match": "Şifrə və şifrənin təsdiqi uyğun gəlmir",
    "New password and confirm password don't match": "Yeni şifrə və şifrənin təsdiqi uyğun gəlmir",
    "A film with this title already exists!": "Bu adda film artıq mövcuddur!",
    "An error occurred while determining whether a film name is used or not. Please try again later.": "Film adının istifadə edilib-edilmədiyini müəyyən edərkən xəta baş verdi. Zəhmət olmasa bir az sonra yenə cəhd edin."
  }
}
