{
  "translation": {
    "Sign Up": "ЗАРЕГИСТРИРОВАТЬСЯ",
    "Log in": "ВОЙТИ",
    "Sign Up for Free": "Зарегистрироваться бесплатно",
    "Welcome back": "С возвращением",
    "GET STARTED": "НАЧАТЬ",
    "Enter your username": "Введите ваше имя пользователя...",
    "Enter your email address": "Введите ваш адрес электронной почты...",
    "Set a password": "Установите пароль...",
    "Confirm the password": "Подтвердите пароль...",
    "Forgot Password": "Забыли пароль",
    "Remember me": "Запомнить меня",
    "404 - Not Found": "404 - Страница не найдена",
    "Sorry, the page you are looking for does not exist": "Извините, страница, которую вы ищете, не существует.",
    "Exit": "Выход",
    "Send Feedback": "Отправить отзыв",
    "Delete Account": "Удалить аккаунт",
    "Year": "Год",
    "Rating": "Рейтинг",
    "Genre": "Жанр",
    "Comment": "Комментарий",
    "Name": "Имя:",
    "Last name": "Фамилия:",
    "Phone": "Телефон:",
    "Email": "Email:",
    "Suggestion": "Предложение:",
    "Submit": "Отправить",
    "Reset Password": "Сбросить пароль",
    "Title": "Название",
    "Enter movie title": "Введите название фильма...",
    "Year (between 1900 and 2025)": "Год (от 1900 до 2025)",
    "Action": "Боевик",
    "Comedy": "Комедия",
    "Drama": "Драма",
    "Horror": "Ужасы",
    "Science Fiction": "Научная фантастика",
    "Enter a comment": "Введите комментарий...",
    "Rating (between 0 and 10)": "Рейтинг (от 0 до 10)",
    "Add": "Добавить",
    "Previous": "Предыдущий",
    "Next": "Следующий",
    "Films": "Фильмы",
    "Add film to Watch List": "Добавить фильм в список для просмотра",
    "Add film": "Добавить фильм",
    "Download as .txt": "скачать как .txt",
    "Download as .docx": "скачать как .docx",
    "Download as .json": "скачать как .json",
    "Watched Films": "Просмотренные фильмы",
    "Unwatched Films": "Непросмотренные фильмы",
    "Search either by title or by year or by genre or by rating": "Поиск по названию, году, жанру или рейтингу",
    "Edit": "Редактировать",
    "Update": "Обновить",
    "Delete": "Удалить",
    "To Main List": "К главному списку",
    "To Watch List": "К списку для просмотра",
    "Not interested": "Не интересует",
    "Bad interface": "Плохой интерфейс",
    "Bad features": "Плохие функции",
    "Found new website": "Нашел новый веб-сайт",
    "Other": "Другое",
    "Type \"yes\" to confirm deletion": "Введите \"yes\", чтобы подтвердить удаление:",
    "Thank you for your feedback! You'll be navigated to the menu.": "Спасибо за ваш отзыв! Вы будете перенаправлены в меню.",
    "An error occurred:": "Произошла ошибка:",
    "An error occurred while sending a feedback. Please try again later.": "Произошла ошибка при отправке отзыва. Пожалуйста, попробуйте позже.",
    "Your email was reseted successfully! Check your email!": "Ваш электронный адрес успешно сброшен! Проверьте свою электронную почту!",
    "An error occurred while reseting a password. Please try again later.": "Произошла ошибка при сбросе пароля. Пожалуйста, попробуйте позже.",
    "An error occurred while getting film data. Please try again later.": "Произошла ошибка при получении данных о фильме. Пожалуйста, попробуйте позже.",
    "Please select a reason and type \"yes\" in the confirmation field.": "Выберите причину и введите \"yes\" в поле подтверждения.",
    "An error occurred while getting deleting an account. Please try again later": "Произошла ошибка при удалении аккаунта. Пожалуйста, попробуйте позже.",
    "You successfully deleted your account! You'll be navigated to the menu.": "Вы успешно удалили свой аккаунт! Вы будете перенаправлены в меню.",
    "Please specify movie genre and title.": "Укажите жанр и название фильма.",
    "An error occurred while adding a film. Please try again later.": "Произошла ошибка при добавлении фильма. Пожалуйста, попробуйте позже.",
    "An error occurred while generating a random login. Please try again later.": "Произошла ошибка при генерации случайного логина. Пожалуйста, попробуйте позже.",
    "An error occurred while downloading your list of films. Please try again later.": "Произошла ошибка при загрузке списка ваших фильмов. Пожалуйста, попробуйте позже.",
    "An error occurred while downloading your list of films (watch list). Please try again later.": "Произошла ошибка при загрузке списка ваших фильмов (список для просмотра). Пожалуйста, попробуйте позже.",
    "An error occurred while updating a film. Please try again later.": "Произошла ошибка при обновлении фильма. Пожалуйста, попробуйте позже.",
    "An error occurred while deleting a film. Please try again later.": "Произошла ошибка при удалении фильма. Пожалуйста, попробуйте позже.",
    "An error occurred while downloading locally your list of films. Please try again later.": "Произошла ошибка при локальной загрузке списка ваших фильмов. Пожалуйста, попробуйте позже.",
    "An error occurred while changing a password. Please try again later.": "Произошла ошибка при изменении пароля. Пожалуйста, попробуйте позже.",
    "Your password was successfully changed! You'll be navigated to the menu.": "Ваш пароль успешно изменен! Вы будете перенаправлены в меню.",
    "Old Password": "Старый пароль:",
    "New Password": "Новый пароль:",
    "Confirm New Password": "Подтвердите новый пароль:",
    "Change Password": "Изменить пароль",
    "Password and confirm password don't match": "Пароль и подтверждение пароля не совпадают",
    "New password and confirm password don't match": "Новый пароль и подтверждение пароля не совпадают",
    "A film with this title already exists!": "Фильм с таким названием уже существует!",
    "An error occurred while determining whether a film name is used or not. Please try again later.": "Произошла ошибка при определении, используется ли название фильма. Пожалуйста, повторите попытку позже."
  }
}
